Tekla Open API Reference for Tekla Structures 2025
PolyLine Constructor
 Instantiates a polyline with the given Points.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolyLine(
	IEnumerable Points
)
Public Sub New (
	Points As IEnumerable
)
Parameters
Points
Type: System.Collections.IEnumerable
A list of the points that will form the polyline.
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace